garage/frontend/controllers/GarageController.php

    public function actionGetAccessGarage()
    {
    $post = Yii::$app->request->post();
    $user = Yii::$app->user->identity->id;
    $result = 0;
    $id_garage = $post['id'];
    $userAccessGarage = UserAccess::find()->where(['user_id' => $user, 'garage_id' => $id_garage])->all();
---
SELECT * FROM `userAccess` WHERE (`user_id`=1) AND (`garage_id`='2')